{
  "blogs": [
    {
      "id": "my-journey-with-loneliness",
      "category": "Mental Wellness",
      "date": "2025-02-14",
      "title": "My journey with loneliness",
      "summary": "I've experienced feeling lonely despite having supportive relationships. I realized the importance of connecting with myself and now recognize loneliness as a sign to focus on self-care and seek meaningful connections.",
      "readingTime": "10 minutes",
      "body": "The second I started writing this article, Boulevard of Broken Dreams inadvertently started playing in my mind (and now on my speakers). As someone who has written about loneliness in a more informative fashion before, I struggled with what new or innovative things to do with this piece. Until I realized that the reason why I am so drawn to the topic of loneliness is because of my own experience with it.<br/><br/><br/>There is enough <a href='https://youtu.be/_0hxl03JoA0' target='_blank' rel='noopener' style='text-decoration: underline'>research</a> out there to show the adverse effects of loneliness on us. However, what is so interesting to me is the contradiction which we are all fed. Our (Indian) society is a collectivist and interdependent one, which has always put emphasis on connection and maintaining relations. However, there are also deeply entrenched narratives of independence and being self-sufficient; so much so that many people struggle to ask for help. I have also struggled with the line between independence and interdependence, often oscillating between feelings of being lonely and being needy. What I mean by this is that I would simultaneously feel like I should not need any other human being, while also really craving connection and attention. I would not share my feelings with others, and also feel like nobody understood me. It was a paradox I have seen many people also struggle with.<br/><br/><br/>I often felt content being by myself as it gave me a lot of time to explore my hobbies, but I am also a person who loves staying in touch with my loved ones. I love meeting my friends often, getting on regular calls or texting people to see how they are doing. As much as I need my “me time” I genuinely need my “we time” as well. However, I would also struggle if I were the one who constantly tried to be in touch. I would usually not reach out if I needed someone's presence. The strangest thing is that I honestly have a great social support system. I have a family where, despite all our differences, I know that they will always have my back. I have friends who are there for me, who I feel comfortable with, and who I have genuine deep connections with. In fact, at every stage of my life, I have always found amazing friends. For over a decade I was almost always in a serious long-term romantic relationship. Even in the places where I worked I found incredible colleagues who were supportive and understanding. It confused me no end that I would struggle to reach out to people or feel lonely as often as I did despite being lucky in almost all social spheres of my life.<br/><br/><br/>Loneliness always sneakily crept up on me. There was never any big event or trigger. Slowly, day after day, I would feel it become heavier on my chest. It took up almost the entire space in my body. I would talk to people and feel like nobody understood me. I would feel something and not know who to share it with. I would constantly crave somebody to talk to, but no matter who I spoke to that craving never left. Year after year, this loneliness has come and gone. It still comes and goes, but my relationship with it changed the more I understood it. An event that added to this understanding was when in my 3rd year of college I started feeling lonely all of a sudden. This was really strange for me because I lived on a residential campus, had a roommate I loved, friends I was constantly surrounded by, and a partner I was with almost the entire time. I was not craving a deep connection with anybody, I already had it, but I just kept on feeling like something was missing. It was turning into a feeling of emptiness for me, because I felt that if I could feel lonely even after everything I had, then there was no escape from that feeling. It was loneliness mixed with emptiness and helplessness. The only thing I could do was to reflect, to try and understand what it was that I was actually craving. After many days, I realized that what I was missing was actually a deeper connection with myself. Between all the time that I spent on my work and my relationships, I was not getting any time to truly be with myself, to connect with myself. I hardly ever did the things that only I wanted to do. Being social was somehow making me feel more lonely, because connection with others beyond a point requires a strong sense of self, otherwise what was I  using to connect with anyone?<br/><br/><br/>This was also coupled with the fear of college ending. All my closest friends were from different cities, and I was supposed to go abroad for my Master's. I did not know what such distance would do to my friendships. The idea that not only my connection with myself was suffering, but soon my friendships might also potentially suffer, was a lot for me to take. At that time, however, confronting my loneliness became more about confronting myself rather than other people, because I could do nothing to stop college from ending (and the pandemic ended up speeding up that process). In fact, I don't think I even shared my feelings with the people around me, even though this was adding to my loneliness.<br/><br/><br/>Loneliness has also come to me in moments of isolation. In 2021, I finally left for London to pursue my Master's. I had so many dreams and notions of how my life over there would be. It was the typical study abroad Instagram life, where I would meet so many people, go out and have endless experiences, and would just be extremely busy. However, this was far from the reality that I experienced. The pandemic had ensured that it would be difficult to socialize normally. In general I take time to make friends, but there was an added hurdle with classes not occurring offline and there not being enough opportunities to socialize with my peers. I had no family or friends in London, and in most moments I felt utterly alone. I remember falling sick in London, and being so afraid because there was nobody to take care of me (my thoughts took a much darker turn than just that though). For the first time I had the chance to truly understand the difference between isolation and loneliness, because I genuinely did not have people around me whenever I wanted. I was also going through a break up at that time which only added to my feelings of isolation. Even when I made good friends in London, it was not always possible to meet them every time I wanted to do something. It was only after quite a while, and honestly because there was no choice, that I used it as a chance to finally connect with myself. I learnt how to do anything and everything alone. I learnt how to spend hours and hours by myself and not feel lonely. In fact, I learnt to truly enjoy my solitude. Not to say that I did not feel lonely at all, and that I did not also spend hours on video calls with my loved ones back at home. But I was able to distinguish between craving company so that I wouldn't feel lonely, and craving company because I genuinely enjoyed spending time with that person. It is a distinction that has truly come in handy to battle my loneliness now, because everytime I would socialize just to not be alone, I would stop myself and try to reflect on what was truly going on. I became even more certain that loneliness for me was more about connection with myself than just about connection with others.<br/><br/><br/>So, what I have learnt from my loneliness is that it has many shades. There is the kind of loneliness which is more about isolation, and genuinely not having people around you for support. That is the kind that can be extremely difficult to deal with and requires measures to build a support system. But if you have experienced loneliness like me, the kind that comes from not having a deep connection with yourself, then that can be tricky to recognise and deal with. It can actually be a signal to pay more attention to yourself. Loneliness has become an alarm for me, especially when I use other people to run away from it. In those cases, I always know that something deeper is going on, and that I require my own attention, not somebody else's. No matter how many friends you make, that kind of loneliness only goes away with solitude. There are likely many more shades of loneliness that I am yet to experience, and some that may be too much for this piece (and myself) to contain. But my hope with loneliness is to be able to look at it the way I look at all other emotions - passengers in a car that I am driving.",
      "pinned": true,
      "imageName": "blog1"
    },
    {
      "id": "whats-the-mind-body-connect",
      "category": "Stress Management",
      "date": "2025-02-15",
      "title": "What's the Mind-Body Connect?",
      "summary": "Being aware of the mind-body connection is crucial for overall well-being, as emotional and mental states significantly impact physical health. Engaging in mindfulness and addressing root causes of emotional distress can help in better health regulation, preventing long-term negative effects.",
      "readingTime": "15 minutes",
      "body": "Have you ever felt an unexpected pain or stiffness in your neck or legs with seemingly no explanation? Or perhaps you have felt a headache building at your temples even though you cannot think of a reason why. If you have, then these could be instances of your body holding your emotions till they find a release.<br/><br/><br/>The concept of a mind-body connection isn't a ‘new' idea per say. In fact, for a long time the mind and body were considered a single unit across fields of medicine. However, around the 17th century, <a href='https://www.takingcharge.csh.umn.edu/what-is-the-mind-body-connection' target='_blank' rel='noopener' style='text-decoration: underline'>medicinal practices</a> in the Western world started to treat the mind and body as two independent units. While this viewpoint did come with its own advantages, it took away from the influence of emotional and spiritual well-being in human wellness and healing. In more recent times, the idea of strong mind-body connect has been re-entering conversations of healthcare.<br/><br/><br/>When thinking about the mind-body connect, it is first important to understand what is meant by ‘mind' this context. The mind should not be considered synonymous to brain. It has more to do with one's mental state, through their attitudes, emotions, and beliefs about the world around them. Research into the experience of emotions over the years have found that psychological states have an impact on physical well-being and vice versa. So, why is it important to be aware of this connection?<br/><br/><br/>The simple answer to the question is that the awareness of a mind-body connection helps us stay healthy, both physically and mentally. More importantly, being aware of the impact that our mental well-being can have on our physical health can help us tap into the roots of our overall well-being. For instance, if you have been struggling to sleep for a few consecutive nights, which is causing you to have consistent headaches, you might consider taking a melatonin pill to help you regulate your sleep. While this might definitely help you with regulating your sleep, it may not solve the root cause of your insomnia. There could be a multitude of reasons why you could be struggling to sleep. This could include being worried or anxious about something, being upset about an event in your life, or even because you are excited and looking forward to an event. Recognising what is causing physical reactions of sleeplessness and therefore a headache will help you regulate your emotions and address your health behaviours beyond just symptom management.<br/><br/><br/>It is also interesting note that the example above of insomnia, could also become a vicious cycle. This would imply that you could be unable to sleep because of your anxiety, but your anxiety could be further fuelled by your lack of sufficient rest. Therefore, recognising how our mental states are linked to our physical responses is important. Furthermore, physical impacts of mental states are not limited to only external physical health. Over the last two decades, there has been empirical evidence of <a href='https://pubmed.ncbi.nlm.nih.gov/18589562/' target='_blank' rel='noopener' style='text-decoration: underline'>stress altering white blood cells</a>. This can result in white blood cells being less responsive in fighting viral infections and cancer cells. Vaccinations are also found to be less effective in individuals suffering prolonged periods of stress. Long term emotional distress through negative emotions have also been found to <a href='https://positivepsychology.com/mind-body-connection/#theories' target='_blank' rel='noopener' style='text-decoration: underline'>weaken the immunity system</a>. Conversely, positive emotions have been found to have long term health benefits such as reduced illness, reduced pain, and increased longevity. Positive emotions have also been found to create immunity against immune-depressive illnesses like cancer and HIV.<br/><br/><br/>There multiple explanations as to why emotional states have the ability to impact physical well-being and vice versa. It is possible that positive emotions can act as a buffer between the impact of negative emotions and their consequences. It is also possible that having more prolonged positive experiences can increase the capability of making positive lifestyle choices, this could be in terms of forming stronger social bonds, have the energy to regularly engage in movement, or have healthier sleeping habits. Essentially, being in more positive mental spaces increases engagement in behaviours that are good for ones physical health and one's <a href='https://vulnerableminds.wixsite.com/home/post/mental-hygiene-what-why-and-how' target='_blank' rel='noopener' style='text-decoration: underline'>mental hygiene</a>.<br/><br/><br/>The knowledge of the mind-body connection can help us become more aware of our well-being in ways that could be impactful. To start off, it is important to acknowledge that it is not possible to be in positive mental states all the time, neither is that an achievable aim. For varying reasons, a lot of which might be out of our control, our mental states will see their share of ups and downs. However, being aware of how our body stores our emotions and what kind of physical reactions they elicit, can help us navigate and regulate these states better.<br/><br/><br/>The first step to being able to recognise how the mind-body connect plays a role in your life, is to start becoming mindful in recognising how this relation plays out in your life. The ways in which the mind-body connection shows up everyone's life may vary. Try to recognise where in your body you store your emotions like anger, stress, anxiety, and sadness. Recognising where in your body you are holding your emotions can be helpful starting point of emotional regulation. For instance, if you realize that you hold anxiety in your leg muscles, you could try to relieve your leg pain with a hot-water bath. While releasing the tension from your body might not solve the root cause of your anxiety, it can help in keeping the emotion in control and not spiralling further. This can give you the headspace to then address the root cause of your uncomfortable emotion with comparatively less distress.<br/><br/><br/>Further, to connect better with your body, you could engage in activities that are <a href='https://positivepsychology.com/mind-body-connection/#theories' target='_blank' rel='noopener' style='text-decoration: underline'>mindful</a>. Mindfulness consists of any activities that help you connect completely with the present moment and with yourself. While the most commonly recommended method for mindfulness is meditation, it is not the only way to engage in mindfulness. You can find activities that help you feel grounded and connected with yourself. This could include interacting with nature by going on walks, listening to music, dancing, drawing, or any other outlet. Engaging in a mindful activity could help you understand how your mental space shows up in your physical body. It could also help you feel more grounded in the moment, thus regulating any distress you might be feeling.<br/><br/><br/>If you are facing psychosomatic reactions in your body for a prolonged period but cannot pinpoint the source of distress (physical and emotional), it also helpful to consider asking for help. Research has found that getting therapeutic assistance can help with navigating physical distress such as autoimmune flare-ups and other <a href='https://pubmed.ncbi.nlm.nih.gov/18589562/' target='_blank' rel='noopener' style='text-decoration: underline'>immunity system problems</a>. It is important recognise when we are no longer able to only rely on ourselves, and approach professional help, that can guide us through these distresses.<br/><br/><br/>At the end of the day, the ways in which our mental states show up in our body are signals through which our body communicates with us. Ignoring these signs because they are uncomfortable to confront might seem like a convenient short-term option, however, in the long-run these stored distresses have the potential to catch up to us and harm us severely, both mentally and physically.  Therefore, it is important to pay attention to the signs sent to us by our mind and our body about our state of being, for our overall well-being. Everyone deserves for their distresses to be heard and their minds and bodies to be cared for.",
      "pinned": false,
      "imageName": "blog3"
    },
    {
      "id": "mental-hygiene-what-why-how",
      "category": "Self-Care",
      "date": "2025-02-15",
      "title": "Mental Hygiene: What, Why, and How?",
      "summary": "Mental hygiene involves practices that promote mental well-being and prevent mental health difficulties. Incorporating activities like movement, proper sleep, a healthy diet, emotional release, and connection into daily routines can enhance overall mental health and reduce the likelihood of mental health issues.",
      "readingTime": "10 minutes",
      "body": "The first time I heard about mental hygiene was in a <a href='https://www.youtube.com/watch?v=rni41c9iq54' target='_blank' rel='noopener' style='text-decoration: underline'>TEDx talk</a> by Guy Winch. He raised the point that we are taught from childhood how to take care of our physical hygiene. We all brush our teeth and wash ourselves without fail. But nobody talks about taking care of our minds in the same way. I was surprised that even though I was pursuing psychology, this was a thought I had never had. Mental health was rarely spoken about from the perspective of 'health', it was almost always about illness. It occurred to me that we have narratives around how to avoid physical illnesses, how to take care of our bodies so that we don't fall sick; but nobody deals with their emotions until it becomes unbearable, until it is already an illness. This was how I became extremely passionate about mental hygiene and realised just how important it was to increase awareness about it.<br/><br/><br/>Mental hygiene is a broad concept that includes activities which promote mental well-being and help prevent mental health difficulties. Practicing mental hygiene would help people utilise their mental capacity well. Maintaining mental hygiene does not guarantee that you would never have bad days or never get a mental illness, just like brushing every day does not guarantee you would not get a toothache. However, it would reduce the probability of having mental health difficulties and act as a toolkit that you can reach out whenever you need it. This leads to the question of what practices contribute to mental hygiene.<br/><br/><br/>The good news is that there is a lot of overlap between physical and mental health (naturally, since our mind and body are not separate entities and instead are one unit). This means that you already know or practice some of these activities. Additionally, mental hygiene practices are customisable based on your needs and preferences. There is no exhaustive list and you should feel free to add or subtract activities based on what works for you. However there are definitely some activities that need to be included (the first three mentioned below):<br/><br/><br/><ol class='list-decimal'><li>Movement: Unsurprisingly, moving our body is not just good to maintain our physical health but also our mental health. While having a workout regimen is a great idea, even light movement is good for our mind. Whatever form of movement is suitable for you should be incorporated in your daily routine. Even if all you are doing is walking around your neighbourhood, or just stretching. Account for the unique physical needs or constraints that you may have. Additionally, tune into your body to recognise the time that movement has the most impact on your emotions. For example, if you are having a lot of anxiety, doing some form of movement at that moment could help relieve the anxious energy.</li><br/><br/><li>Sleep: Having a good sleep schedule is not just about the hours of sleep you are getting,  sleep quality is more important. Proper sleep is essential for our body and brain to repair and recuperate. Therefore, to ensure good sleep quality, you can try simple tips such as sleeping and waking up at the same time every day, meditating or listening to calming sounds before falling asleep etc. Try to create a night time routine that allows you to unwind and prepare for sleep, rather than simply going to bed right after working or engaging in some other activity. Also, avoid setting a harsh alarm so as to not wake up with a jolt.</li><br/><br/><li>Healthy diet: Our gut health is deeply interconnected with our mental health. Therefore, just by eating the right kind of food we can boost our emotional well-being a lot. Having a healthy diet goes beyond just avoiding unhealthy food. It is important to not exclude any food groups (including carbs) but rather to eat food in a balanced manner. It might be beneficial to reflect on your current diet and see what food groups are under consumed and make a conscious effort to incorporate them more. Additionally, make sure that you are having sufficient vitamins, minerals, and micro-nutrients. Vitamin D and B-complex are essential for good mental health, and coincidentally the most commonly deficient ones. Therefore, consider supplementing these. <a href='https://www.pickuplimes.com/article/food-and-mood-209' target='_blank' rel='noopener' style='text-decoration: underline'>Here</a> is a great article that talks about food and brain health which you can refer.</li><br/><br/><li>Emotional release: It is important for us to acknowledge, accept, and release the feelings and emotions we experience. A lot of times we may hesitate in doing so in front of other people. While it is essential to express ourselves in front of others, it is equally essential to have safe spaces that are private for us to release and express everything we feel. This could include maintaining a journal, recording audio or video diaries or anything else that suits you. Processing emotions is extremely important because repressing emotions can worsen both physical and mental health. Consider reaching out to a mental health professional for the same as well.</li><br/><br/><li>Connection: It is important for us to connect to other beings outside of us. Make sure to make time and space for connecting with other people, with nature, animals (if you like), and a higher power (depending on your faith). Connecting does not mean observing or passively interacting with others. Rather, it is important to be intentional and to only focus on the other being when connecting. For example, if you are out on a nature walk, take some time to touch the trees or put your bare feet on the ground and just focus on the feeling of the soil against your feet.</li></ol><br/><br/><br/>Some other things that you could do include meditation, affirmations, being creative (either conventionally by practicing music, dance, arts etc. or by increasing creativity in your work), spiritual practice etc. Beyond the basics, mental hygiene is not just about the activity but about the intention of taking care of your mind. It is about recognising what activities contribute to your emotional well-being and ensuring that you do those practices regularly.<br/><br/><br/>Now that we have mentioned some activities that you can do as part of your mental hygiene routine, it is important to discuss how these can be incorporated in your life. One of my favorite ways of starting a new habit is habit stacking, as mentioned by James Clear in his book Atomic Habits. There are already various activities that you are doing daily out of habit. The easiest way to incorporate newer habits would be by pairing the new habit with an existing habit. For example, pairing meditation with brushing. Additionally, consider getting an accountability partner. You can either decide to do a particular activity with someone or inform each other when you are doing it, or you can even make it more public by posting daily stories or social media updates to keep yourself accountable. Creating a mental health kit is also a good idea so that you have all the tools you need to take care of yourself in one place, and it can also serve as a reminder to continue with your mental hygiene and self care practices. Finally, it is important to remind yourself that taking care of yourself is not a chore. Practicing mental hygiene can be considered a form of self love. You deserve to be taken care of, regardless of good or bad days. And there is nobody better than you to take care of yourself.",
      "pinned": false,
      "imageName": "blog2"
    },
    {
      "id": "why-you-probably-just-need-to-rest",
      "category": "Self-Care",
      "date": "2025-02-20",
      "title": "Why you probably just need to rest",
      "summary": "Rest is essential not just for physical recovery but also for emotional well-being, yet societal norms often make it feel undeserved. Prioritizing small acts of rest and recognizing emotional fatigue can help rejuvenate both mind and body.",
      "readingTime": "10 minutes",
      "body": "Lately I have realized that there is one kind of intervention that I end up bringing into almost every session - rest. To be honest, I had a lot of self-doubt when I first brought it up. It felt like such a simple, obvious, almost banal suggestion. However, rest is a lot more complex than just taking some time off or not doing anything.<br/><br/><br/>We are used to understanding the amount of effort we have put largely in terms of hours. Additionally, there seems to be an implicit standard of what is a valid enough reason to be tired. I often hear people say that they are tired all the time, but they don't know why or that they didn't do anything intensive to be this tired. And it would leave me having to justify the need for rest and exploring what rest looked like for my clients. These questions also rang in my own ears because even though I knew the importance of rest, I was almost always burnt out from the beginning of my career. There were numerous reasons for me to continue working despite my tiredness, one of them being this comparison of working hours, and how mine looked very different from my friends' who were mostly in corporate jobs. This disregard for my own tiredness became a very useful tool for me to understand our relationship with rest, relaxation, and rejuvenation.<br/><br/><br/>From the lens of an anti-capitalist ideology, rest is a radical act. It is the act of choosing to be a human being rather than a machine with the sole purpose of contributing to the society via economic and materialistic growth. It is an act to oppose the conversion of human lives to mere resources, a means to an end. And while I do believe in this ideology, I also understand the deep-rooted beliefs around productivity and creation as a metric for human worth. I do not believe that human beings need to prove their worth. Worth for what? Worthy of what? These are questions I have asked in the therapy room, often to no concrete answers. However, just because we are inherently worthy (to exist or of love) does not mean that we do not have a desire to do something with our time and cognitive faculties. Nor does it deny the existence of the current system where only very few (and usually the rich) have the privilege of saying that they do not want to work themselves to the bone. We are caught in a vicious cycle where to get some rest you first need to work extremely hard. And the standards of rest have also come from a capitalist system, where we are either expected to have certain creature comforts, or have been made to believe through media that the way to live a good life is to have said creature comforts. This does not even include how we need money for our basic needs, and therefore there are very tangible consequences to not subscribing to ableist standards of productivity. Resting is made to look like a weakness. Something that we should not do too often, not unless we have gone through significant hardship already and therefore deserve to rest. It makes sense then that it is a radical act.<br/><br/><br/>However, it is also not possible for everyone to look at rest through such a political lens. For a large portion of the population, there is simply not enough time or energy to sit and reflect on such things, or to even act on them. All these thoughts can make life seem even more heavy. A very counterintuitive effect for an exploration of rest. But this is not the only way to approach rest.<br/><br/><br/>Rest is not just required to recover from the daily demands of our work, it is also required to support us through the emotional demands of our existence. You may not be tired because of your job (though it may be a contributing factor in prolonging the tiredness). Likely there are a lot of emotions stored within your body that are taking up your bandwidth. Very few people are taught how to process and move through emotions. We are mostly taught to ignore how we feel and move on (and this varies based on factors such as gender, access etc.). The hectic demands of life continue to leave very little time and space for us to process or feel our feelings. All of this builds up and leads to fatigue, and in more severe cases, even chronic pain conditions.<br/><br/><br/>Rest, therefore, is not just about work-life balance, or spa days, or vacations. It is the act of meeting your body’s needs and allowing yourself the space and time to cope and rejuvenate. Life is made up of both big and small acts and choosing to focus on the small things is just as important as valid. So here are some small (and maybe some big) thoughts, questions, and actions that you can reflect on and incorporate in your life.<br/><br/><ol class='list-disc'><li>Sleep is not the only form of rest you need.</li><br/>A lot of times when I ask people “what do you do to rest?”, I am told that they sleep and that is about it. You would need sleep even if you did nothing all day. Sleep is maintenance, it is as essential to your body as drinking water every day. Of course you need to sleep, but there might be other things that you need to do as well to ensure that you are also energizing your body.<br/><br/><li>What is your current relationship with rest?</li><br/>This is a big question, but you can break it down and reflect on it. The first step to doing that is to observe yourself. Have you been tired lately? For how long? How do you respond when you (or someone around you) needs to rest? Do you ever use rest as a reward for working hard? Are there things that your body needs that it is not getting? This is by no means an exhaustive list of questions for this exploration, but it is a start.<br/><br/><li>What is the smallest possible act of rest that you can incorporate in your life?</li><br/>Some potential options include closing your eyes for a couple of minutes after every 30-60 minutes of work. Or some light stretching. Or using a hot/cold pack on spots where you are holding tension or feeling pain. If achieving a state of complete rest and relaxation is unattainable, then what would help you get 5% of rest? Start small.<br/><br/><br/>It is also important to start recognizing whether your tiredness is purely due to physical labour or could it be because of unprocessed emotions. It can be helpful to seek professional assistance to support you in releasing stress and emotions from your body. A professional using body-based or somatic interventions would be able to support you in this journey. Remember that no single action is enough to improve your symptoms. Be gentle and kind with yourself and allow your body the rest that it needs.",
      "pinned": false,
      "imageName": "blog5"
    },
    {
      "id": "companies-rolling-back-dei-policies",
      "category": "Mental Wellness",
      "date": "2025-03-18",
      "title": "Companies Rolling Back DEI Policies",
      "summary": "Companies rolling back DEI policies reveal that inclusion was never truly part of their culture. This shift not only harms employee well-being but also sets a precedent of neglecting workplace psychological safety, leading to long-term consequences in motivation, retention, and organizational trust.",
      "readingTime": "10 minutes",
      "body": "Multiple global companies have taken the recent global events as a free pass to rollback their DEI policies. Now that they are no longer ‘obligated’ to be inclusive owing to changes in the US law, companies have immediately dropped it from their company agenda. Apart from the glaringly obvious question mark on company value systems and culture that such a move brings up, there are also questions about workplace well-being and consequences of such a move that need to be addressed.<br/><br/><br/>Being ‘inclusive’ had become a corporate buzzword in the last half decade. Following the case of <a href='https://www.nbcnews.com/news/nbcblk/diversity-roles-disappear-three-years-george-floyd-protests-inspired-rcna72026' target='_blank' rel='noopener' style='text-decoration: underline'>George Floyd</a> in 2020 and the public backlash that came with it, companies felt pressurized to prove their progressive stances. Companies which have made the choice to rollback their DEI policies (now that they can) show very clearly that inclusion was never a part of their culture. Diversity is a matter of numbers, where organizations feel the need to fill quotas to show that their company has employees from diverse backgrounds. However, an inclusive and equitable culture is one where the hired diversity truly has the space to express themselves and be themselves. What does it mean for folks from marginalized and oppressed background in organizations when companies don’t hold space for them?<br/><br/><br/>The consequences of the rollback on employee well-being and satisfaction has been immediate. There has been a <a href='https://www.wellright.com/resources/blog/attack-on-dei-why-rolling-back-on-diversity-destroys-wellness#:~:text=From%20any%20angle%2C%20the%20ripple,and%20employee%20mental%20health%20plummets.' target='_blank' rel='noopener' style='text-decoration: underline'>32% decrease</a> in the wellness, satisfaction and retention of employees. What is really being hurt when diverse hires are brought for the sake of saving face is the psychological safety of those employees. Individuals from marginalized and oppressed communities in organizations which simply don’t have space for them have no psychological safety to be themselves. They are constantly aware that they can be judged, bullied, and harassed, with little to no means of protecting themselves.<br/><br/><br/>There is no doubt there is a grave injustice to the route that organizations have taken with regard to these policies. However, they should be concerned about the long-term consequences of such an action on their organization. When an organization shows that they would abandon the well-being of their employees the minute they are not bound by legality, what sort of cultural precedent are they setting? It isn’t just individuals who are presently parts of vulnerable communities who are taking note of this (though they are the ones bearing the burden of it). Employees now recognize that their well-being is neither safe nor a priority in their workspace. The result of which a lack of motivation and higher risks of burnout of employees in the long-run. As a consequence, organizations will struggle to retain good employees and also in the future struggle to hire good employees.<br/><br/><br/>Such steps are a clear indication of undoing progress that vulnerable communities have managed to create for themselves to protect their peace and well-being. Being psychologically safe and recognizing fairness in treatment is one of the bare bones of workplace mental well-being and rolling back on DEI policies hurts the very core of that. There is no doubt that there is a strong enough community and massive public outcry to question such injustice. However, it is unfair that individuals should have to repeatedly defend their right to exist and survive alongside their peers just because they don’t fit into neat boxes. Such companies should question what their values stand for if basic safety is so easy for them to dismantle.",
      "pinned": false,
      "imageName": "blog6"
    },
    {
      "id": "when-thereapist-struggles-with-mental-health",
      "category": "Mental Wellness",
      "date": "2025-05-24",
      "title": "When a Therapist Struggles with Their Mental Health",
      "summary": "Mental health professionals, despite their expertise, are not immune to struggles and often face burnout, depression, and anxiety, which highlight the need for community care and deeper human connection. The author emphasizes the importance of acknowledging therapists’ humanity, breaking unrealistic expectations, and fostering spaces where they feel seen and supported.",
      "readingTime": "10 minutes",
      "body": "It is not a new concept, the fact that mental health professionals struggle with their mental health. I know that my profession does not take away my inherent humanness. I know that I have struggled with my mental health in the past and am likely to do so in the future. Knowing any of this did nothing to reduce my struggle when I first faced mental health challenges after I became a therapist. However, I am finally ready to sit with this struggle, to understand and explain what exactly happened and why, and to embrace all the learnings this experience has brought me. The most important thing, however, is that I want to contribute to the narrative that humanizes mental health professionals. We are just as human. We do not have all the answers to life. We do not need to be pedestalized.<br/><br/><br/>For about a decade now I have experienced bouts of depression at least once a year. They have varied in intensity, but they have been present without a doubt. I have also struggled with intense anxiety. I have been working on myself in therapy for a long time; however, I was looking at my own journey very differently until I became a therapist myself. I always thought my depression is a consequence of my circumstances. It took a while before I started acknowledging my trauma and the potential impact it had on my mental health. It was only after becoming a therapist, though, that I realized my experience was more complicated. I started acknowledging and exploring my neurodivergence, the layers of my identity, my trauma, and everything in between. It is a journey I will probably be on all my life, though I hope that it stops being as confusing as it has been so far. I also started experiencing frequent burnouts, a term that I have stopped resonating with but will use for the sake of convenience.<br/><br/><br/>The work of a mental health professional is emotionally very demanding. Unfortunately, there is no way to know what kind of ritual would support a person through it. The things that I had done for my mental health till that point were inadequate, and I only realized this much later. I had also not accounted for the kind of impact the world situation would have on me. The more I looked at mental health from a social justice and decolonized perspective, the harder it became to separate my clients’ problems from the systemic injustice and oppression that was prevalent in the world. It also became difficult to separate my own problems in a similar way. While I am grateful for this perspective and awareness, I cannot deny the hopelessness it brings. I cannot help but think sometimes that the society we have created sets us up for failure, and no matter what I do as an individual, it will never be enough to change it. Just writing these words brings up a knot in my throat. The result of this is that in every session I am sitting with double the amount of hopelessness. Not only do I feel a lot for my clients (and sometimes physically feel what they are feelings), I also feel frustration at not being able to change their situation, and then hopeless about the society both for them and for myself. Usually after this I would just disconnect from everything and distract myself to cope. This has not proven to be very effective in the long term, and I felt inadequate as a therapist because I did not have a “proper self-care” routine.<br/><br/><br/>I think using words like self-care feels shallow and inauthentic these days, because it makes me feel like I am failing somehow in holding space for myself and others. There was this pressure to be regulated constantly or to not get affected by the lives of my clients. However, I do not think I can function that way. My clients are not just my clients; they are not people who need to be “fixed”. They are whole human beings and the only way I can care for them is by truly connecting with their lives. While I understand that their pain is not mine to feel, I do not know how to go unaffected by their emotions. My intention is not to glorify any particular way of work, it’s just how I function. Similarly, for my own emotions, I know how to manage or regulate myself. But what I truly need – what I think we all truly need – is space to hold the dysregulation. In my desire to be a “good” therapist, I became so hard on myself that I could not fully and authentically express all my emotions. Everything became something to navigate, or regulate, or an individual gap that I had to work to fill.<br/><br/><br/>What I think is needed in the current mental health landscape is the integration of community care and connection. This is not new, but it is still such a struggle. And while this is true for people in general, I want to emphasize on the need for community care for mental health practitioners. The structure of our work is built so that we are either being exploited (underpaid and over-worked), or we must go off on our own which makes an already difficult job very isolating. On days where I have felt heavy, conversations with other therapists, or if I am lucky my supervisors, has helped me more than any grounding exercise. When I have questions about the purpose of our work, and doubts about its usefulness, I do not find scientific evidence or AI generated answers supportive. What I crave is a space where my pain and exhaustion are understood, and where I do not feel alone in this journey of mental health support. And it is extremely hard to have these spaces in abundance. It is not confidentiality that stops me from talking about my work (I can speak about it without disclosing client information), it is the lack of understanding and the grandiose notions about the work that make it so hard to feel seen. It is questions like “what kind of people come to you in therapy” and jokes like “how can you act this way being a therapist”. Not necessarily bad intentioned words, but isolating nonetheless.<br/><br/><br/>The purpose of writing this blog is not to place blame. It is an attempt to show my humanness. It is to give an insight into my experience as a person who is also a therapist. And somewhere there is also a hope that other therapists will resonate with what I said and feel seen. Maybe we would even become a part of each other’s community. And of course, maybe my grandest hope is to reach people who do not know too much about therapy. I hope my vulnerability not just encourages you to be vulnerable, but also lets you know that I understand how hard it can be to acknowledge the truth, even to yourself. There is no shortcut to good mental health, nor is it the final destination, even for a therapist.<br/><br/><br/>",
      "pinned": false,
      "imageName": "blog6"
    }
  ]
}
